# Задача 26: Напишите программу, которая на вход принимает
# два числа A и B, и возводит число А в целую степень B с
# помощью рекурсии.

from CustomFuncs import *
# a = int(input('Введите А: ')) 
# b = int(input('Введите В: ')) 
# print(exponentiation(a, b))

# Задача 28: Напишите рекурсивную функцию sum(a, b),
# возвращающую сумму двух целых неотрицательных чисел. Из
# всех арифметических операций допускаются только +1 и -1.
# Также нельзя использовать циклы.

a = int(input('Введите a: ')) 
b = int(input('Введите b: ')) 
print(sum(a,b))